Revit 2027 API
CompoundStructure.IsValidRegionId Method
 Determines whether the specified integer is actually the id of a region in this CompoundStructure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidRegionId(
	int regionId
)
Public Function IsValidRegionId (
	regionId As Integer
) As Boolean
public:
bool IsValidRegionId(
	int regionId
)
member IsValidRegionId :
        regionId : int -> bool
Parameters
regionId Int32
 The id of a region in this vertically compound structure.
Return Value
Boolean
 True if the region is valid, false otherwise.
Exceptions
Exception | Condition
InvalidOperationException |  This operation is valid only for vertically compound structures.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace